app/channels/application_cable/connection.rb

    def authenticated_user!
      token = extract_token_from_header
      reject_unauthorized_connection unless token

      payload = decode_jwt(token)
      user_id = payload['sub']

      current_user = User.find_by(id: user_id)

      raise StandardError unless current_user.present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]