app/serializers/conversation_serializer.rb

  def participants
    current_user_id = @instance_options[:scope]

    object.conversation_participants.includes(:user).map do |participant|
---
SELECT "conversation_participants".* FROM "conversation_participants" WHERE "conversation_participants"."conversation_id" = $1  [["conversation_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 18], ["id", 6]]