app/channels/conversations_channel.rb

  def subscribed
    user_conversations = Conversation.joins(:conversation_participants).where(conversation_participants: { user_id: current_user.id })
    user_conversations.each do |conversation|
---
SELECT "conversations".* FROM "conversations" INNER JOIN "conversation_participants" ON "conversation_participants"."conversation_id" = "conversations"."id" WHERE "conversation_participants"."user_id" = $1  [["user_id", 19]]