app/channels/conversations_channel.rb

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."authentication_token" = $1 LIMIT $2  [["authentication_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def subscribed
    conversation = Conversation.find(params[:conversation_id])
    reject_unauthorized_connection unless params[:token].present? &&
      User.find_by(authentication_token: params[:token]).present?