app/controllers/api/v1/conversations_controller.rb

      def show
        conversations = current_user.conversations.includes(:users)
        render json: { success: true, conversations: conversations.map do |conversation|
---
SELECT DISTINCT "users".* FROM "users" INNER JOIN "conversation_participants" ON "conversation_participants"."user_id" = "users"."id" WHERE "conversation_participants"."conversation_id" IN (SELECT "conversations"."id" FROM "conversations" INNER JOIN "conversation_participants" ON "conversations"."id" = "conversation_participants"."conversation_id" WHERE "conversation_participants"."user_id" = $1) AND "users"."id" != $2 AND "users"."user_id" = $3 ORDER BY "users"."id" ASC LIMIT $4  [["user_id", 18], ["id", 18], ["user_id", 6], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" INNER JOIN "conversation_participants" ON "conversations"."id" = "conversation_participants"."conversation_id" WHERE "conversation_participants"."user_id" = $1  [["user_id", 6]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 18], ["id", 6], ["id", 14], ["id", 19]]

      def set_conversation
        @conversation = current_user.conversations
                                    .includes(:users)
                                    .find_by(id: index_conversation_params[:conversation_id])
---
SELECT "conversations".* FROM "conversations" INNER JOIN "conversation_participants" ON "conversations"."id" = "conversation_participants"."conversation_id" WHERE "conversation_participants"."user_id" = $1 AND "conversations"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 18], ["id", 6]]

      def set_recipient
        @recipient = User.find_by!(email: conversation_params[:to_email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "isabellagiraldosoto@gmail.com"], ["LIMIT", 1]]