app/controllers/api/v1/conversations_controller.rb

SELECT "conversation_participants".* FROM "conversation_participants" WHERE "conversation_participants"."conversation_id" IN ($1, $2, $3, $4)  [["conversation_id", 1], ["conversation_id", 2], ["conversation_id", 3], ["conversation_id", 5]]
---
      def new
        raise 'Conversation already exists' unless should_create?

        new_conversation = Conversation.create!(
          admin_id: @recipient.present? ? nil : current_user.id,
          title: conversation_params[:title] || 'New conversation',
          is_private: @recipient.present?
        )

        new_conversation.conversation_participants.create!(
          user: current_user
        )

        new_conversation.conversation_participants.create!(user: @recipient) if @recipient.present?