app/controllers/api/v1/conversations_controller.rb

    def new
      recipient = User.find_by!(email: params['to_email'])
      conversation_exists = current_user.contacts.any? do
          |contact| contact.id === recipient.id
      end

      raise 'Conversation already exists' if conversation_exists.present?

      new_conversation = Conversation.create!(
          admin_id: recipient.present? ? nil : current_user.id,
          title: params['title'] || "New conversation",
          is_private: recipient.present?
      )

      new_conversation.conversation_participants.create!(
          user: current_user
      )

      if (recipient.present?)
        new_conversation.conversation_participants.create!(user: recipient)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "camilo1999gutierr@gmail.com"], ["LIMIT", 1]]
INSERT INTO "conversations" ("is_private", "title", "admin_id", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["is_private", true], ["title", "New conversation"], ["admin_id", nil], ["deleted_at", nil], ["created_at", "2024-09-08 00:02:04.999822"], ["updated_at", "2024-09-08 00:02:04.999822"]]
INSERT INTO "conversation_participants" ("conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["conversation_id", 5], ["user_id", 18], ["created_at", "2024-09-08 00:02:05.008249"], ["updated_at", "2024-09-08 00:02:05.008249"]]
INSERT INTO "conversation_participants" ("conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["conversation_id", 5], ["user_id", 19], ["created_at", "2024-09-08 00:02:05.015235"], ["updated_at", "2024-09-08 00:02:05.015235"]]

    def show
      render json: { success: true, conversations: current_user.conversations.map {
---
SELECT "conversations".* FROM "conversations" INNER JOIN "conversation_participants" ON "conversations"."id" = "conversation_participants"."conversation_id" WHERE "conversation_participants"."user_id" = $1  [["user_id", 18]]

    def index
      conversation = Conversation.find_by(id: params[:conversation_id])
      raise 'User has no access to this conversation.' if conversation.conversation_participants.find_by(user_id: current_user.id).nil?
---
SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 14], ["LIMIT", 1]]
SELECT "conversations".* FROM "conversations" INNER JOIN "conversation_participants" ON "conversations"."id" = "conversation_participants"."conversation_id" WHERE "conversation_participants"."user_id" = $1 AND "conversations"."id" = $2 LIMIT $3  [["user_id", 18], ["id", 3], ["LIMIT", 1]]
SELECT "conversation_participants".* FROM "conversation_participants" WHERE "conversation_participants"."conversation_id" = $1 AND "conversation_participants"."id" = $2 LIMIT $3  [["conversation_id", 3], ["id", 14], ["LIMIT", 1]]