app/controllers/api/v1/messages_controller.rb

      def validate_conversation_participant
        return if @conversation.users.find_by!(id: current_user.id).present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]