app/controllers/api/v1/messages_controller.rb

SELECT "conversation_participants".* FROM "conversation_participants" WHERE "conversation_participants"."conversation_id" = $1 AND "conversation_participants"."user_id" = $2 LIMIT $3  [["conversation_id", 2], ["user_id", 18], ["LIMIT", 1]]
INSERT INTO "messages" ("content", "deleted_at", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def new
        if @conversation.conversation_participants.find_by(user_id: current_user.id).nil?
          raise 'User has no access to this conversation.'
        end

        new_message = Message.create!(
          conversation_id: @conversation&.id,
          content: params['content'],
          user_id: current_user&.id
        )

SELECT "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1  [["conversation_id", 3]]
---
      def show
        messages = @conversation.messages
        render json: { success: true, message: messages.map { |message| MessageSerializer.new(message) } }

SELECT "conversations".* FROM "conversations" WHERE "conversations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
      def set_conversation
        @conversation = Conversation.find_by!(id: params[:conversation_id])