app/controllers/api/v1/user_controller.rb

SELECT "users".* FROM "users"
---
            def show
                user = User.all