app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
  def authenticate_user!
    token = extract_token_from_header

    if token
      payload = decode_jwt(token)
      user_id = payload['sub']
      @current_user = User.find_by(id: user_id)