app/controllers/registrations_controller.rb

  def validate_new_user
    user = User.find_by(email: registration_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]