app/controllers/sessions_controller.rb

  def create
    user = User.find_for_database_authentication(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "camilo@gmail.com"], ["LIMIT", 1]]

  def validate_authorization
    return nil if request.headers['Authorization'].blank?

    jwt_payload = JWT.decode(
      request.headers['Authorization'].split(' ').last,
      Rails.application.credentials.devise_jwt_secret_key!
    ).first

    User.find(jwt_payload['sub'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]