app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 6], ["id", 14]]
---
  def contacts
    # Get the participants of the conversations the user is a part of
    # remove the user instance calling the method
    ConversationParticipant
      .where(conversation_id: conversations.select(:id))
      .where.not(user_id: id)
      .select('DISTINCT ON (user_id) *')
      .includes(:user)
      .map(&:user)